trade_exp/src/InformationRegisters/ABCКлассификацияНоменклатуры_Альтерра/ABCКлассификацияНоменклатуры_Альтерра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ABCКлассификацияНоменклатуры_Альтерра</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Класс</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="80d8f3a4-6b7b-4718-8ee3-b7242a527914">
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ABCКлассификацияНоменклатуры_Альтерра/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Функция ВернутьКлассТовара(Номенклатура,Подразделение) экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ABC.Класс КАК Класс
		|ИЗ
		|	РегистрСведений.ABCКлассификацияНоменклатуры_Альтерра.СрезПоследних КАК ABC
		|ГДЕ
		|	ABC.Номенклатура = &Номенклатура
		|	И ABC.Подразделение = &Подразделение";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	если ВыборкаДетальныеЗаписи.Следующий() тогда
		возврат ВыборкаДетальныеЗаписи.Класс; 
	иначе
		возврат Перечисления.ABCКлассификация_Альтерра.ПустаяСсылка();
	Конецесли;
	
КонецФункции // ВернутьКлассТовара()
	
	
#КонецЕсли
